tsung/test1.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
<clients>
	<client host="localhost" use_controller_vm="true" maxusers="15000"/>
</clients>
<servers>
	<server host="INSTANCE_IP_OR_DNS_HERE" port="80" type="tcp"/>
</servers>
<load>
	<!-- simple testing -->
	<arrivalphase phase="1" duration="10" unit="second">
		<users arrivalrate="1" unit="second"/>
	</arrivalphase>
	<!-- end simple testing -->

	<!-- complex testing -->
	<!-- <arrivalphase phase="1" duration="30" unit="second">
		<users arrivalrate="1" unit="second"></users>
	</arrivalphase>
	<arrivalphase phase="2" duration="30" unit="second">
		<users arrivalrate="2" unit="second"></users>
	</arrivalphase>
	<arrivalphase phase="3" duration="30" unit="second">
		<users arrivalrate="4" unit="second"></users>
	</arrivalphase>
	<arrivalphase phase="4" duration="30" unit="second">
		<users arrivalrate="8" unit="second"></users>
	</arrivalphase> -->
	<!-- end complex testing -->
</load>
<options>
	<option name="glocal_ack_timeout" value="2000"/>
	<option type="ts_http" name="user_agent">
		<user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
		Firefox/1.0.4</user_agent>
	</option>
 </options>
 <sessions>
	<session name="http-example" probability="100" type="ts_http">
		<!-- setup some random variables -->
      	<setdynvars sourcetype="random_string" length="6">
        	<var name="new_user_name" />
      	</setdynvars>

		<!-- get the root route -->
		<request>
			<http url="/" version="1.1" method="GET"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- get signup page -->
		<request>
			<http url="/signup" version="1.1" method="GET"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- signup new user -->
		<request>
			<http 
				url="/users"
				version="1.1"
				method="POST"
				contents="name=%%new_user_name%%&amp;
						user_name=%%new_user_name%%&amp;
						email=%%new_user_name%%@gmail.com&amp;
						password=password&amp;
						password_confirmation=password"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- logout -->


		<!-- login -->
		<!-- <http url="/signin" version="1.1" method="GET"/> -->


		<!-- edit background in profile -->
		<request>
			<http url="/%%new_user_name%%/edit" version="1.1" method="GET"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- edit background in profile -->
		<request>
			<http url="/%%new_user_name/edit" 
				version="1.1" 
				method="POST" 
				contents="background=random%20background"/>
		</request>

		<!-- get new event form -->
		<request>
			<http url="/events/new" version="1.1" method="GET"/>
		</request>

		<!-- create an event -->
		<!-- for date
			2i = month
			3i = day
			1i = year
			4i = hour (24 hr clock)
			5i = mins
		!-->
		<request>
			<dyn_variable name="created_event_url" re="[Ll]ocation: (http://.*)\r"/>
			<dyn_variable name="created_event_id" re="[Ll]ocation: http://.*/events/(.*)\r"/>
			<http url="/events/new" 
				version="1.1"
				method="POST"
				contents="title=christmas&amp;
					date%282i%29=12&amp;
					date%283i%29=25&amp;
					date%281i%29=2016&amp;
					date%284i%29=6&amp;
					date%285i%29=30&amp;
					location=north%20pole" />
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- get edit page for event -->
		<request>
			<http url="/events/%%created_event_id%%/edit" 
				version="1.1"
				method="GET"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- edit event -->
		<request>
			<http url="/events/%%created_event_id%%" 
				version="1.1"
				method="POST"
				contents="description=a%20%23christmas%20party" />
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- follow user1 (first result) -->
		<request>
			<http url="/relationships/follow_user/user1" 
				version="1.1" 
				method="POST"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- go to user1's profile -->
		<request>
			<http url="/user1" version="1.1" method="GET"/>
		</request>

		<thinktime value="2" random="true"></thinktime>

		<!-- join 2 of his events -->

		<!-- leave one of them -->

		<!-- sign out -->
		<request>
			<http url="/signout" version="1.1" method="POST"/>
		</request>


	</session>
 </sessions>
</tsung>